<?php
require_once(dirname(__FILE__) ."/libcode/base.php");
require_once(dirname(__FILE__) ."/libcode/session.php");
/*接口编号=>存储过程名.
  如果接口需要特殊处理.例如下面的0005至0008的接口.value可以填写为
  空.在interface.php中增加case进行特殊处理.可参考这0005-0008的例子.
*/
$GLOBALS["IPUBLICE"] = array(
	"0001"=>"p_order_generate",#获取订单号
	"0002"=>"p_update_order_ios",#更新订单状态(ios)
	"0003"=>"p_modifypwd",#修改密码
	"0004"=>"p_set_newpwd",#设置新密码
	"0005"=>"",//密保绑定
	"0006"=>"",//密保绑定校验
	"0007"=>"",//密码找回
	"0008"=>"",//密码找回校验
	"0009"=>"p_general_code",//生成验证码
	"0010"=>"p_check_code",//校验验证码
	"0011"=>"p_regist",//注册
	"0012"=>"p_role_modify",//修改角色
	"0013"=>"p_auth_modify",//修改权限
	"0014"=>"p_authority_add",#添加权限
	"0015"=>"p_authority_del",#删除权限
	"0016"=>"p_role_add",#添加角色
	"0017"=>"p_role_del",#删除角色
	"0018"=>"p_role_auth_bind",#角色绑定权限
	"0019"=>"p_role_auth_unbund",#角色解除权限的绑定
	"0020"=>"p_clt_info_ext",//客户端升级
	"0022"=>"p_getall_role",//查询所有的角色
	"0023"=>"p_getall_auth",//查询所有的权限
	"0024"=>"p_getauth_byrole",//查询某个角色下的权限列表.
	"0026"=>"p_login",//正常帐号密码登录
	"0027"=>"",//发送短信验证码
	"0028"=>"",//校验图片验证码
	"0029"=>"",//发送邮件
        "0030"=>"",//文件上传
	"0032"=>"",//html2pdf
	"0034"=>"p_other_login",	//第三方登录
	"0035"=>"p_account_bind",	//绑定第三方
	"0036"=>"",	//取服务器时间
	"0037"=>"",	//发送注册激活邮件
	"0038"=>"",	//注册邮件验证
	"0039"=>"",	//注销  登出
	"0040"=>"",	//生成图片，保存在服务器
	"0041"=>"p_order_pay_result",	// 设置支付结果
	"0042"=>"p_order_fee_calc",	//查询订单
	"0043"=>"p_order_pay_info",	//根据选择支付方式，查询支付需要携带的参数
	"0044"=>"",                     //根据选择支付方式，查询支付需要携带的参数（客户端app）
	"0045"=>"",                     //移动端，查询订单  app  对账接口
        "0046"=>"p_order_generate",    //获取订单号，用于app端，无需查询userid，由接口传过来
        "0047"=>"",    // 支付宝验签
	
    
	"0999"=>""//公共接口的最大编号
);

//统计不需要检测登录状态的接口
$GLOBALS['_NOCHECKLOGIN'] = array(
	"0011"=>1,
	"0026"=>2,
	"0027"=>3,
	"0028"=>4,
	"0034"=>5,
	"0036"=>6,
	"0030"=>7,
	"0037"=>7,
	"0038"=>8,
	"0039"=>9,
	"0044"=>10,//移动端app
	"0045"=>11,//移动端app
	"0046"=>12,//移动端app
        "0050"=>13,//购物车
    );

?>

